In [2]:
import pandas as pd
import numpy as np

In [3]:
dict1 ={
    "name":['maulik', 'patel'],
    "marks":[90,70],
    "city":["una","khilavad"]
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

     name  marks      city
0  maulik     90       una
1   patel     70  khilavad

In [6]:
df.to_csv('dict1.csv')

In [7]:
df.to_csv('dict1.csv', index=False)

In [8]:
df.head(1)

     name  marks city
0  maulik     90  una

In [10]:
df.tail(1)

    name  marks      city
1  patel     70  khilavad

In [11]:
df.describe()

           marks
count   2.000000
mean   80.000000
std    14.142136
min    70.000000
25%    75.000000
50%    80.000000
75%    85.000000
max    90.000000

In [14]:
data = pd.read_csv('dict2.csv')

In [15]:
data

   Train no  speed      city
0      1325     55       una
1      1265     70  khilavad

In [16]:
data['speed']

0    55
1    70
Name: speed, dtype: int64

In [17]:
data['speed'][0]

55

In [18]:
data['speed'][0]=79

/tmp/ipykernel_13552/639477049.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['speed'][0]=79

In [19]:
data

   Train no  speed      city
0      1325     79       una
1      1265     70  khilavad

In [22]:
data.to_csv('dict2.csv')

In [24]:
data.index=['first', 'second']

In [25]:
data

        Train no  speed      city
first       1325     79       una
second      1265     70  khilavad